{
    "version": "https://jsonfeed.org/version/1",
    "title": "Tim's Blog",
    "description": "Personal website of Tim Kicker",
    "home_page_url": "https://tim.kicker.dev",
    "items": [
        {
            "id": "https://tim.kicker.dev/2023/08/02/digital-nomad/",
            "url": "https://tim.kicker.dev/2023/08/02/digital-nomad/",
            "title": "The first digital nomad",
            "date_published": "2023-08-02T11:48:32.000Z",
            "content_html": "<p>In the 1980s, the idea of working remotely while traveling the world seemed like something straight out of a sci-fi novel. Yet, one man defied the norms of his time and embarked on a groundbreaking journey that would make him the first-ever digital nomad.</p>\n<p><img src=\"/2023/08/02/digital-nomad/Behemoth.jpg\"></p>\n<p>Steven K. Roberts and “Behemoth”, taken from <a href=\"https://teknomadics.com/2011/10/the-original-digital-nomad/\">Teknomadics</a></p>\n<h2 id=\"A-Journey-Ahead-of-Its-Time\"><a href=\"#A-Journey-Ahead-of-Its-Time\" class=\"headerlink\" title=\"A Journey Ahead of Its Time\"></a>A Journey Ahead of Its Time</h2><p>In 1983, <a href=\"https://twitter.com/nomadness\">Steven K Roberts</a> set out on an extraordinary adventure, pedaling across the United States on a recumbent bicycle he called “Winnebiko” (his later  models were called “Winnebiko 2” and <a href=\"https://de.wikipedia.org/wiki/Behemoth_(Mythologie)\">“Behemoth”</a>). What made this journey unique was the impressive array of technology packed into the bicycle’s streamlined body, including solar panels, a computer, a ham radio, and other cutting-edge gadgets.</p>\n<p>Roberts’ vision was to merge technology and nomadic living, proving that one could work remotely and stay connected with the world while exploring new horizons. As he traversed the American landscape, he chronicled his experiences and technological innovations in articles for <a href=\"https://en.wikipedia.org/wiki/Computer_Currents\">“Computer Currents” magazine</a>, capturing the imaginations of readers everywhere.</p>\n<p><img src=\"/2023/08/02/digital-nomad/thumbnail.jpg\"></p>\n<p>Steven and his second bike, taken from <a href=\"https://microship.com/bikes/\">his website</a></p>\n<h2 id=\"Reactions-and-Comments\"><a href=\"#Reactions-and-Comments\" class=\"headerlink\" title=\"Reactions and Comments\"></a>Reactions and Comments</h2><p>During the 1980s, Roberts’ audacious endeavor sparked both awe and skepticism. Many people were fascinated by his nomadic lifestyle and the creative use of technology to maintain communication and work on the go. They saw his journey as an inspirational tale of freedom and possibility, challenging the traditional notion of work confined to brick-and-mortar offices.</p>\n<p>However, others viewed Roberts’ quest with doubt and disbelief. The idea of working remotely and relying on technology to sustain such a lifestyle was seen as an eccentric and unrealistic notion (lol). Skeptics questioned the feasibility of his technological setup and doubted whether it could lead to any meaningful career.</p>\n<p>Nonetheless, the mixture of reactions, whether supportive or doubtful, only fueled Roberts’ determination to prove that the concept of remote work and digital nomadism could be more than just a pipe dream.</p>\n<p><img src=\"/2023/08/02/digital-nomad/article.jpg\"></p>\n<p>A newspaper article, photo by <a href=\"https://gizmoeditor.blogspot.com/2020/09/catching-up-with-digital-nomad-steve.html\">Gizmo</a></p>\n<h2 id=\"Life-Today\"><a href=\"#Life-Today\" class=\"headerlink\" title=\"Life Today\"></a>Life Today</h2><p>So, what is Steven doing now? Well, after his groundbreaking bicycle journey across the United States, Roberts continued to embrace his technomadic lifestyle to inspire a new generation of digital nomads by sharing his wisdom and expertise through speaking engagements, workshops, and various media platforms. He explored further technological frontiers and authored several books, sharing his experiences and insights into a world that has now fully embraced remote work and digital nomadism.</p>\n<p>Not only that, he is still working remotely from his home: A boat c:</p>\n<p><img src=\"/2023/08/02/digital-nomad/onboat.jpg\"></p>\n<p>Roberts in his home, taken from <a href=\"https://www.sanjuanjournal.com/life/wizard-with-a-time-machine/\">The Journal of San Juan Islands</a></p>\n<h2 id=\"He-paved-the-way\"><a href=\"#He-paved-the-way\" class=\"headerlink\" title=\"He paved the way\"></a>He paved the way</h2><p>Steven K Roberts’ bold journey as the first digital nomad was truly something new. His fusion of technology and nomadic living challenged societal norms and laid the groundwork for the modern-day remote work revolution. Although met with both curiosity and skepticism, Roberts’ determination and vision proved that the impossible can become possible with courage and creativity.</p>\n<p>The internet revolution that followed in the 1990s and early 2000s further expanded the possibilities for remote work and nomadic living. Today, countless individuals around the globe are living the dream that Roberts dared to dream decades ago.</p>\n<p><img src=\"/2023/08/02/digital-nomad/farahead.jpg\"></p>\n<p>Quote from Steven, far ahead of his time</p>\n",
            "tags": []
        },
        {
            "id": "https://tim.kicker.dev/2023/07/25/beautiful-internet/",
            "url": "https://tim.kicker.dev/2023/07/25/beautiful-internet/",
            "title": "The internet has become soulless and i hate it",
            "date_published": "2023-07-25T14:16:48.000Z",
            "content_html": "<p>Do you remember the early days of the internet, when websites were a reflection of their creators unique personalities and passions? A time when the digital landscape was a canvas of vibrant colors and creativity, and the online community was the driving force behind its evolution? The internet of yesteryear was a place of genuine connection, diversity, and personal expression. The golden era when the web was a virtual wonderland, ruled by users rather than profit-driven corporations.</p>\n<p><img src=\"/2023/07/25/beautiful-internet/internet.jpg\"></p>\n<p>“Internet”, an unknown 90’s stock image</p>\n<h2 id=\"The-Personal-Touch\"><a href=\"#The-Personal-Touch\" class=\"headerlink\" title=\"The Personal Touch\"></a>The Personal Touch</h2><p>Back then, websites were more like digital diaries. Each website felt like stepping into the creator’s mind – a place where they poured their heart and soul, sharing their interests, hobbies, and thoughts with the world. Sadly, im simply too young to remember such a place in detail but i was able to experience some of it during my first steps on the internet back in 2009, when most of these sites were still up and big companies did not yet have the upper hand over the internet.. </p>\n<p>Moreover, the internet provided a platform for enthusiasts to come together and create niche communities. From fan forums to personal blogs, people found like-minded individuals who shared their passions, creating a sense of camaraderie that was truly special. </p>\n<p><img src=\"/2023/07/25/beautiful-internet/forum.png\"></p>\n<p>The <a href=\"https://forum.melonland.net/\">Melonland</a> forum</p>\n<h2 id=\"Colorful-Creativity\"><a href=\"#Colorful-Creativity\" class=\"headerlink\" title=\"Colorful Creativity\"></a>Colorful Creativity</h2><p>Each blog was an explosion of colors and creativity. Every website had its own distinctive flair, reflecting the personality of its creator. Whether it was the playful use of neon colors or the subtle elegance of pastel shades, each one stood out from the rest, showcasing the artistry and individuality of its designer.</p>\n<p>Web pages were adorned with animated backgrounds, cursor trails, and unique icons. Yes, some might argue that it could get overwhelming at times, but it was just this boundless creativity that made every browsing experience a delightfully unpredictable adventure.</p>\n<p><img src=\"/2023/07/25/beautiful-internet/gifypet.png\"></p>\n<p><a href=\"https://gifypet.neocities.org/\">Gifypet</a>, a gif pet creation tool (??!!)</p>\n<h2 id=\"User-Centric-Community\"><a href=\"#User-Centric-Community\" class=\"headerlink\" title=\"User-Centric Community\"></a>User-Centric Community</h2><p>In those days, the internet was driven by its users. Their sites were designed to engage and entertain, not to bombard visitors with advertisements or collect data for profit. Online interactions were genuine, and social media platforms were still in their infancy, free from the burden of algorithms and targeted advertising.</p>\n<p>The online community was a powerful force, shaping the internet’s evolution through collaborative efforts and shared feedback. User-generated content, such as forums, chat rooms, and guest books, encouraged open discussions and fostered a sense of belonging in the digital realm.</p>\n<p><img src=\"/2023/07/25/beautiful-internet/blog-color.png\"></p>\n<p>Blog by <a href=\"https://combatbaby.neocities.org/\">Bryce</a></p>\n<h2 id=\"Big-corpo\"><a href=\"#Big-corpo\" class=\"headerlink\" title=\"Big corpo\"></a>Big corpo</h2><p>As time passed, the internet underwent a transformation. The rise of social media giants and corporate interests gradually shifted the balance of power from users to profit-driven organizations. The personalized, colorful web pages became streamlined, conforming to modern design standards and sacrificing individuality for uniformity.</p>\n<p>Online communities lost some of their authenticity, as algorithms began to dictate content and user engagement. The once user-centric internet was now influenced by commercial interests, and our online experiences were curated based on our data, making it harder to find the hidden gems we once stumbled upon.</p>\n<p>I alwas catch myself rotating between the same few websites where all of them happen to be blank and soulless social media sites. Every profile looks the same and i hate it.</p>\n<h2 id=\"Can-we-get-back\"><a href=\"#Can-we-get-back\" class=\"headerlink\" title=\"Can we get back?\"></a>Can we get back?</h2><p>Today, the internet may have evolved into a more streamlined and efficient entity, but the nostalgia for the old days persists. As we navigate the modern digital landscape, let us not forget the vibrant, user-driven internet of the past, and strive to preserve the spirit of creativity, personalization, and community in our online interactions. After all, the true beauty of the internet lies in the hands of its users – both then and now.</p>\n<p>But not all hope is lost and there are some great gems hidden in the depth of the web, which we can enjoy and take an example from. We should let it inspire us to create new blogs and such sites by ourself to (maybe) revive this era of the internet.</p>\n<p>I’ve recently stumbled upon <a href=\"http://wiby.me/\">Wiby</a>, which is a search engine that only indexes Web1.0 sites. I’ve already spent hours surfing through those colorful pages.</p>\n<p>There’s also a special webhoster called <a href=\"https://neocities.org/\">Neocities</a> where users can create retro looking pages and host them for free. (Even you could create one as well!)</p>\n<p>A <a href=\"https://dollchan.net/chanlist/chanlist-en.html\">couple of imageboards</a> still exist, who remind us of a different time. You may not like it, but even <a href=\"https://4chan.org/\">4chan</a> is such a place and i am happy that dumpster is still around.</p>\n<p>I’m also currently working on a Web1.0 version of my blog. <del>I’ll probably update this entry and link to it, once it’s finished.</del></p>\n<p><a href=\"https://blog.kicker.dev/\"><strong>Here it is!</strong></a></p>\n",
            "tags": []
        },
        {
            "id": "https://tim.kicker.dev/2023/07/18/telegram/",
            "url": "https://tim.kicker.dev/2023/07/18/telegram/",
            "title": "Should it really be Telegram?",
            "date_published": "2023-07-18T13:08:40.000Z",
            "content_html": "<p>In recent years, WhatsApp has become one of the most popular messaging apps worldwide, connecting billions of people across the globe. However, beneath its seemingly user-friendly interface, there are growing concerns about privacy, security, and the impact of its corporate parent, Facebook. As a result, many users are seeking alternatives to WhatsApp that prioritize their digital well-being. However, it seems like most people are switching to another messenger that I’m pretty unsure about.</p>\n<h3 id=\"It’s-open-source-Right\"><a href=\"#It’s-open-source-Right\" class=\"headerlink\" title=\"It’s open source. Right?\"></a>It’s open source. Right?</h3><p>Telegram states the following on their website:</p>\n<blockquote><p>Telegram apps are open source and support reproducible builds. Anyone can independently verify that Telegram apps you download from App Store or Google Play were built using the exact same code that we publish.</p>\n<footer><strong>Telegram</strong><cite><a href=\"https://telegram.org/apps\">telegram.org/apps</a></cite></footer></blockquote>\n\n\n<p>While those two sentences are not wrong, they are dangerously misleading consumers. See, what they are stating here is that their <strong>clients</strong> are open source. Their server code however still remains <strong>closed</strong> and therefore we do not know what Telegram actually does with our data. </p>\n<h3 id=\"No-encryption-no-peace-of-mind\"><a href=\"#No-encryption-no-peace-of-mind\" class=\"headerlink\" title=\"No encryption, no peace of mind\"></a>No encryption, no peace of mind</h3><p>While Telegram offers end-to-end encryption in its “Secret Chats,” this feature is <a href=\"https://www.howtogeek.com/709484/how-to-start-an-encrypted-secret-chat-in-telegram/\"><strong>not enabled by default</strong></a> for regular chats. This means that the content of your conversations may not be fully secure unless you specifically <strong>opt in</strong> for Secret Chats. Telegram has also faced criticism regarding the lack of independent audits of its encryption protocols, unlike Signal, which has undergone extensive third-party security audits. Without such audits, it is rather hard to prove that their E2EE is powerfull enough.</p>\n<h3 id=\"But-what-should-we-use-instead\"><a href=\"#But-what-should-we-use-instead\" class=\"headerlink\" title=\"But what should we use instead\"></a>But what should we use instead</h3><p>There are many other great privacy respecting messenging apps which i’d rather use than telegram. I’ve listed my favorite ones below:</p>\n<p><a href=\"https://www.signal.org/de/\">Signal</a>: Known for its strong encryption, Signal offers end-to-end encryption by default for all conversations and has a focus on user privacy. Like I already said, it has undergone independent security audits and is widely regarded as one of the most secure messaging apps available.</p>\n<p><a href=\"https://threema.ch/de\">Threema</a>: Probably the OG because it’s the oldest one. Also requires no phone number to sign up (!!!)</p>\n<p><a href=\"https://element.io/\">Element</a> (Matrix): Element is an open-source, decentralized messaging platform that uses the <a href=\"https://matrix.org/\">Matrix protocol</a>. </p>\n",
            "tags": []
        },
        {
            "id": "https://tim.kicker.dev/2023/05/18/whatsapp-analyze/",
            "url": "https://tim.kicker.dev/2023/05/18/whatsapp-analyze/",
            "title": "Data about data",
            "date_published": "2023-05-18T14:26:18.000Z",
            "content_html": "<p>I am a huge fan of gathering, analyzing and evaluating data. Creating statistics and colorful graphs just has something to it. But the interesting part is not necessarily the data itself, it’s the data about the data. How often does something occur, at which time and by whom are very important characteristics when it comes to creating patterns.</p>\n<p>For example, let’s look at the two weekday-graphs of two different WhatsApp chats of mine.</p>\n<p><strong>Weekdays Chat A</strong></p>\n<p><img src=\"/2023/05/18/whatsapp-analyze/hourchartA.png\"></p>\n<p><strong>Weekdays Chat B</strong></p>\n<p><img src=\"/2023/05/18/whatsapp-analyze/hourchartB.png\"></p>\n<p>It is not that hard to figure out the difference between those two graphs. The number of daily messages in A is pretty stable except for Friday and Monday, which are two extremes. Maybe this could be about a friend group planning what they’re going to do on the weekend? The general quantity of messages is also lower as in figure B. The second chat also has a huge gap between Sunday and Saturday. Could this be a group chat related to work? Or is it someone close who happens to live in the same house?</p>\n<p>You can see that it is possible to gather connections and create assumptions about certain topics without even looking at the data itself. Now let’s take a deeper look.</p>\n<p><strong>Days-Heatmap Chat A</strong></p>\n<p><img src=\"/2023/05/18/whatsapp-analyze/heatmapA.png\"></p>\n<p>How interesting. We can see that the group is most active between the end of January till May and spikes again in October. If you happen to live in Austria, you probably know what that means. See, in most areas, the Austrian summer break for students lasts from June till the beginning of September while Christmas lasts from December to January. There is also one small break during November. You can clearly see that this could be a chat between friends who happen to be students but don’t have the same classes together. They probably spend a lot of their free time together, which explains the lack of data during the breaks. No one texts another person while they’re sitting next to them… right?</p>\n<p><strong>Days-Heatmap Chat B</strong></p>\n<p><img src=\"/2023/05/18/whatsapp-analyze/heatmapB.png\"></p>\n<p>We can see that the amount of messages remains pretty stable. This could prove our theory of two people in the same household as true. Maybe the gap in August could be a planned vacation?</p>\n<p>It would be pretty frighting if I told you all our assumptions were correct. Right? You may now probably recognize that metadata is a lot more valuable than you originally thought. But what conclusions can we draw from this newly gained awareness? </p>\n<p>Most people rely on the encryption of their messaging apps. If no one can read my data then I am safe, right? No. As we can see, an attacker does not need access to your communication in order to gather valuable information.</p>\n<p>If you want to look more into this topic, I’d recommend watching <a href=\"https://www.youtube.com/watch?v=-YpwsdRKt8Q\">Daniel Kriesel’s 33c3 presentation</a>.</p>\n",
            "tags": []
        }
    ]
}